export const links = [
  {
    url: 'https://wastecommunity.com',
    label: 'wastecommunity web link',
    text: '👉 웹 보러가기 👈',
  },
];
export const skills = ['Vue.js', 'Typescript', 'Scss', 'Vuex', 'Vuetify', 'Git', 'Github'];
export const roles = ['프론트엔드 개발'];
export const workDetails = [
  {
    content: '초기 로딩속도 향상을 위한 최적화 작업 수행',
    contentDetails: [
      'Bundle 최적화(802.28KB → 733.58KB)',
      'Font 최적화(4.7MB ⇒ 196KB)',
      'Code Splitting',
    ],
  },
  { content: 'Responsive UI 구현', contentDetails: [] },
  {
    content: '아래의 장점을 생각하여 Typescript 도입',
    contentDetails: [
      '미리 타입을 지정하여 개발자의 실수를 줄일수 있음',
      '코드 가독성과 유지보수성 향상',
      '객체 안의 필드값에 대한 IDE의 리스트 업 기능',
    ],
  },
  { content: '사용자별 인가 처리를 위해 Axios Interceptor를 이용한 Jwt관리', contentDetails: [] },
  {
    content: '회원 관련 기능 구현',
    contentDetails: ['로그인, 회원가입, 비밀번호 찾기, 마이페이지 정보 관리'],
  },
  {
    content: '게시글 관련 기능 구현',
    contentDetails: [
      '게시글 조회•삭제, 게시글 상세내용 조회, 좋아요, 스크랩, 댓글 작성, 대댓글 작성, 신고하기, 쪽지 보내기 등등',
    ],
  },
  {
    content: '기타 기능 구현',
    contentDetails: [
      '알림 내역 관리, 1:1 문의, 쪽지 조회•발송•삭제, 유저 차단, 신고하기, 스크랩한 글•작성한 글•작성한 댓글 관리 등등',
    ],
  },
  {
    content: '사내 Waste Community 서비스 관리를 위한 관리자 페이지 개발',
    contentDetails: [
      '회원 정보 조회•수정•삭제, 게시글 조회•수정•삭제, 회원 및 게시글 내역 통계 차트 구현 등등',
    ],
  },
];
